source/_posts/2016-03-13-undertand-javascript-this-keyword.html
---
title: "理解 Javascript This 关键字"
date: 2016-03-14
layout: post
categories: 
- Javascript
tags: 
- Javascript
published: true
comments: 
---
<p>
在我最早接触 Javascript 的时候，This 关键字着实让我摸不着头脑。还有与 This 相关的一些函数，比如 bind，call 和 apply 也是难以掌握。本文试图用几个简单的例子来理解 This 关键字。
</p>

<p>
本文内容大纲：
</p>

<ol class="org-ol">
<li>This 绑定的内容与函数无关，而与函数的执行环境有关。</li>
<li>函数的 This 绑定的内容可以通过 bind，apply 和 call 函数来动态进行修改。</li>
<li>巧用闭包可以消除不必要的 This 动态绑定，提高代码的可读性。</li>
</ol>

<p>
<!-- more -->
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">This 绑定内容与函数无关，而与执行环境有关</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
在<a href="http://zilongshanren.com/blog/2016-03-13-understand-javascript-scope-and-scope-chain.html">上篇文章</a> 中，我们提到了，一个函数在调用时会创建一个活动对象，而此活动对象中还包含一个非常重要的信息，即 This
变量。
</p>

<p>
我们先看下面这个例子：
</p>


<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"zilong"</span>;

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">myfunc</span> = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.name<span style="color: #b58900;">)</span>;
<span style="color: #2aa198;">}</span>

myfunc<span style="color: #2aa198;">()</span>;
</pre>
</div>

<p>
当我们调用 myfunc 函数时，Js 引擎会创建一个执行上下文，同时会初始化一个作用域链，此作用域链为：
</p>


<pre class="example">
[[scope chain]] = [
{
    Active Object {
         arguments: ...
         this: [global Object],
         ...
    },
     global Object: {
          name: 'zilong'
          ...
     }
}
]
</pre>

<p>
所以，当我们执行 console.log(this.name)的时候，this 绑定的是全局对象，而我们之前定义的 name 就是属于全局变量。
</p>

<p>
我们再看一下下面这个例子：
</p>


<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"zilong"</span>;
<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">sex</span> = <span style="color: #2aa198;">"man"</span>;

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">myfunc</span> = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">name</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
    <span style="color: #268bd2; font-weight: bold;">this</span>.name = name;
<span style="color: #2aa198;">}</span>

myfunc.<span style="color: #268bd2; font-weight: bold;">prototype</span>.print = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.name<span style="color: #b58900;">)</span>;
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.sex<span style="color: #b58900;">)</span>;
    console.log<span style="color: #b58900;">(</span>sex<span style="color: #b58900;">)</span>;
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">obj</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">myfunc</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">"hello"</span><span style="color: #2aa198;">)</span>;
obj.print<span style="color: #2aa198;">()</span>;
</pre>
</div>

<p>
RESULTS:
</p>
<pre class="example">
hello
undefined
man
</pre>

<p>
当我们执行 obj 对象的 print 函数的时候，我们的执行上下文的作用域链是这样的：
</p>


<pre class="example">
[[scope chain]] = [
{
    Active Object {
         arguments: ...
         this: obj,
         ...
    },
     global Object: {
          name: 'zilong',
          sex: 'man',
          ...
     }
}
]
</pre>

<p>
从这个作用域链，我们可以很清楚地知道上面代码的输出结果。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">This 绑定的内容可以被动态修改</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
同样的是上面那个例子，我们稍微修改一下：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"zilong"</span>;
<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">sex</span> = <span style="color: #2aa198;">"man"</span>;

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">myfunc</span> = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">name</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
    <span style="color: #268bd2; font-weight: bold;">this</span>.name = name;
<span style="color: #2aa198;">}</span>

myfunc.<span style="color: #268bd2; font-weight: bold;">prototype</span>.print = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.name<span style="color: #b58900;">)</span>;
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.sex<span style="color: #b58900;">)</span>;
    console.log<span style="color: #b58900;">(</span>sex<span style="color: #b58900;">)</span>;
<span style="color: #2aa198;">}</span>.bind<span style="color: #2aa198;">(</span><span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #2aa198;">)</span>;

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">obj</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">myfunc</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">"hello"</span><span style="color: #2aa198;">)</span>;
obj.print<span style="color: #2aa198;">()</span>;
</pre>
</div>

<p>
RESULTS:
</p>
<pre class="example">
zilong
man
man
</pre>

<p>
我们通过给 myfunc.prototype.print 函数添加了 bind 的调用，我们发现输出的结果完全不同了。因为此时的 this 绑定的是
global 对象了。
</p>

<p>
同样的，如果我们把代码改成下面的样子：
</p>


<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"zilong"</span>;
<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">sex</span> = <span style="color: #2aa198;">"man"</span>;

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">myfunc</span> = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">name</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
    <span style="color: #268bd2; font-weight: bold;">this</span>.name = name;
<span style="color: #2aa198;">}</span>

myfunc.<span style="color: #268bd2; font-weight: bold;">prototype</span>.print = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.name<span style="color: #b58900;">)</span>;
    console.log<span style="color: #b58900;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.sex<span style="color: #b58900;">)</span>;
    console.log<span style="color: #b58900;">(</span>sex<span style="color: #b58900;">)</span>;
<span style="color: #2aa198;">}</span>;

<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">obj</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">myfunc</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">"hello"</span><span style="color: #2aa198;">)</span>;
myfunc.<span style="color: #268bd2; font-weight: bold;">prototype</span>.print.call<span style="color: #2aa198;">(</span>obj, <span style="color: #2aa198;">"hello"</span><span style="color: #2aa198;">)</span>;
</pre>
</div>

<p>
RESULTS:
</p>
<pre class="example">
hello
undefined
man
</pre>

<p>
这个输出结果与我们直接调用 obj.print 是一样的。
</p>

<p>
但是如果我们改成:
</p>


<div class="org-src-container">

<pre class="src src-js">  <span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">obj</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">myfunc</span><span style="color: #2aa198;">(</span><span style="color: #2aa198;">"hello"</span><span style="color: #2aa198;">)</span>;
  myfunc.<span style="color: #268bd2; font-weight: bold;">prototype</span>.print.call<span style="color: #2aa198;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>, <span style="color: #2aa198;">"hello"</span><span style="color: #2aa198;">)</span>;
<span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">&#19979;&#38754;&#30340; window &#21644; this &#26159;&#31561;&#20215;&#30340;&#12290;</span>
<span style="color: #93a1a1;">//  </span><span style="color: #93a1a1;">myfunc.prototype.print.call(window, "hello");</span>
</pre>
</div>

<p>
输出结果会是：
</p>


<p>
RESULTS:
</p>
<pre class="example">
zilongshanren
man
man
</pre>

<p>
使用 bind 可以显式指定函数调用时的 this 绑定，而使用 call 可以指定 this 对象的指向，另外，还可以使用 apply 来修改 this 的绑定。call 和 apply 的区别就是 call 后面传参使用的是逗号分隔的参数，而 apply 传递的则是一个参数数组。
</p>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">巧用闭包消除 This 动态绑定，提高代码可读性</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
假设我们要把一个外部环境的 this 变量传递到一个内部函数去使用，一般我们会这么做：
</p>


<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">a</span> = <span style="color: #6c71c4;">10</span>;
<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">obj</span> = <span style="color: #2aa198;">{</span>
    a : <span style="color: #6c71c4;">1</span>,
    b : <span style="color: #6c71c4;">2</span>,

    <span style="color: #268bd2;">sum</span> : <span style="color: #859900; font-weight: bold;">function</span><span style="color: #b58900;">()</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">addA</span> = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #268bd2;">(</span><span style="color: #268bd2;">a</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">return</span>  <span style="color: #268bd2; font-weight: bold;">this</span>.a + a;
        <span style="color: #268bd2;">}</span>.bind<span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #268bd2;">)</span>;

        <span style="color: #859900; font-weight: bold;">return</span> addA<span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.b<span style="color: #268bd2;">)</span>;
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>

console.log<span style="color: #2aa198;">(</span>obj.sum<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span>;
</pre>
</div>

<p>
RESULTS:
</p>
<pre class="example">
3
</pre>

<p>
在声明 addA 的时候，我们使用了 bind(this)，那么 addA 函数内部的 this.a 指向的是 obj 对象的 a 变量。如果我们不使用 bind 的话，
this 默认指向的是 window 对象，那么输出的结果就是 12 了。
</p>

<p>
一般情况下面，此时 sum 函数里面的 3 个 this 就容易把人搞晕了，我们通常会通过添加一个 self 或者 that 局部变量来增加代码的可读性，同时也不用手动去调用 bind 函数。
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">a</span> = <span style="color: #6c71c4;">10</span>;
<span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">obj</span> = <span style="color: #2aa198;">{</span>
    a : <span style="color: #6c71c4;">1</span>,
    b : <span style="color: #6c71c4;">2</span>,

    <span style="color: #268bd2;">sum</span> : <span style="color: #859900; font-weight: bold;">function</span><span style="color: #b58900;">()</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">self</span> = <span style="color: #268bd2; font-weight: bold;">this</span>;

        <span style="color: #859900; font-weight: bold;">var</span> <span style="color: #268bd2;">addA</span> = <span style="color: #859900; font-weight: bold;">function</span><span style="color: #268bd2;">(</span><span style="color: #268bd2;">a</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">return</span>  self.a + a;
        <span style="color: #268bd2;">}</span>;

        <span style="color: #859900; font-weight: bold;">return</span> addA<span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">this</span>.b<span style="color: #268bd2;">)</span>;
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>

console.log<span style="color: #2aa198;">(</span>obj.sum<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span>;
</pre>
</div>

<p>
RESULTS:
</p>
<pre class="example">
3
</pre>

<p>
这里面的 self 变量利用了闭包的特性，同时让代码更加具有可读性，也消除了不必要的 bind(this)调用。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">小结</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
其实 This 并不复杂，只是跟我们熟悉的面向对象语言有差异罢了，理解了执行上下文，作用域链和活动对象的概念，This 也就明了了。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Reference</h2>
<div class="outline-text-2" id="text-orgheadline5">
<ul class="org-ul">
<li><a href="https://toddmotto.com/understanding-the-this-keyword-in-javascript/">https://toddmotto.com/understanding-the-this-keyword-in-javascript/</a></li>
</ul>
</div>
</div>
